# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

month = int(input("Введите порядковый номер месяца: "))
months = ["Январь", "Февраль", "Март", "Апрель", "Май",
          "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
season = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
season_dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето",
               7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}

if month > 0  and month <= 12:
    print("Вы выбрали: ", months[month - 1])
    print("Решение через list:")
    print("Время года: ", season[month - 1])
    print("Решение через dict:")
    print("Время года: ", season_dict.get(month))
else:
    print("Такого месяца не существует. По крайней мере на нашей планете.")
